---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLSpaceType
source: html/12d333f9-5da5-053c-5e94-81525892baa3.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLSpaceType

This enumeration corresponds to the spaceType attribute in gbXML.
 The enumerated attribute identifies the type of space defined and
 allows to better approximate the actual internal loads and schedules
 associated with the defined space type.

## Syntax (C#)
```csharp
public enum gbXMLSpaceType
```